## Staging
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 2 to add, 2 to change, 2 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                         RESOURCE                          |
|--------|-----------------------------------------------------------|
| add    | `aws_ecr_lifecycle_policy.superset_docs_test`             |
|        | `aws_ecr_repository.superset_docs_test`                   |
| update | `module.superset_docs.aws_iam_policy.non_vpc_policies[0]` |
|        | `module.superset_docs.aws_lambda_function.this`           |
| delete | `aws_ecr_lifecycle_policy.superset_doc_test`              |
|        | `aws_ecr_repository.superset_doc_test`                    |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
 <= read (data resources)

Terraform will perform the following actions:

  # aws_ecr_lifecycle_policy.superset_doc_test will be destroyed
  # (because aws_ecr_lifecycle_policy.superset_docs was moved to aws_ecr_lifecycle_policy.superset_doc_test, which is not in configuration)
  # (moved from aws_ecr_lifecycle_policy.superset_docs)
  - resource "aws_ecr_lifecycle_policy" "superset_doc_test" {
      - id          = "cds-superset-docs" -> null
      - policy      = jsonencode(
            {
              - rules = [
                  - {
                      - action       = {
                          - type = "expire"
                        }
                      - description  = "Keep last 30 release tagged images"
                      - rulePriority = 1
                      - selection    = {
                          - countNumber   = 30
                          - countType     = "imageCountMoreThan"
                          - tagPrefixList = [
                              - "v",
                            ]
                          - tagStatus     = "tagged"
                        }
                    },
                  - {
                      - action       = {
                          - type = "expire"
                        }
                      - description  = "Keep last 10 git SHA tagged images"
                      - rulePriority = 10
                      - selection    = {
                          - countNumber   = 10
                          - countType     = "imageCountMoreThan"
                          - tagPrefixList = [
                              - "sha-",
                            ]
                          - tagStatus     = "tagged"
                        }
                    },
                  - {
                      - action       = {
                          - type = "expire"
                        }
                      - description  = "Expire untagged images older than 7 days"
                      - rulePriority = 20
                      - selection    = {
                          - countNumber = 7
                          - countType   = "sinceImagePushed"
                          - countUnit   = "days"
                          - tagStatus   = "untagged"
                        }
                    },
                ]
            }
        ) -> null
      - registry_id = "257394494478" -> null
      - repository  = "cds-superset-docs" -> null
    }

  # aws_ecr_lifecycle_policy.superset_docs_test will be created
  + resource "aws_ecr_lifecycle_policy" "superset_docs_test" {
      + id          = (known after apply)
      + policy      = jsonencode(
            {
              + rules = [
                  + {
                      + action       = {
                          + type = "expire"
                        }
                      + description  = "Keep last 30 release tagged images"
                      + rulePriority = 1
                      + selection    = {
                          + countNumber   = 30
                          + countType     = "imageCountMoreThan"
                          + tagPrefixList = [
                              + "v",
                            ]
                          + tagStatus     = "tagged"
                        }
                    },
                  + {
                      + action       = {
                          + type = "expire"
                        }
                      + description  = "Keep last 10 git SHA tagged images"
                      + rulePriority = 10
                      + selection    = {
                          + countNumber   = 10
                          + countType     = "imageCountMoreThan"
                          + tagPrefixList = [
                              + "sha-",
                            ]
                          + tagStatus     = "tagged"
                        }
                    },
                  + {
                      + action       = {
                          + type = "expire"
                        }
                      + description  = "Expire untagged images older than 7 days"
                      + rulePriority = 20
                      + selection    = {
                          + countNumber = 7
                          + countType   = "sinceImagePushed"
                          + countUnit   = "days"
                          + tagStatus   = "untagged"
                        }
                    },
                ]
            }
        )
      + registry_id = (known after apply)
      + repository  = "cds-superset-docs"
    }

  # aws_ecr_repository.superset_doc_test will be destroyed
  # (because aws_ecr_repository.superset_docs was moved to aws_ecr_repository.superset_doc_test, which is not in configuration)
  # (moved from aws_ecr_repository.superset_docs)
  - resource "aws_ecr_repository" "superset_doc_test" {
      - arn                  = "arn:aws:ecr:ca-central-1:257394494478:repository/cds-superset-docs" -> null
      - id                   = "cds-superset-docs" -> null
      - image_tag_mutability = "MUTABLE" -> null
      - name                 = "cds-superset-docs" -> null
      - registry_id          = "257394494478" -> null
      - repository_url       = "257394494478.dkr.ecr.ca-central-1.amazonaws.com/cds-superset-docs" -> null
      - tags                 = {
          - "CostCentre" = "cds-superset-docs-staging"
          - "Terraform"  = "true"
        } -> null
      - tags_all             = {
          - "CostCentre" = "cds-superset-docs-staging"
          - "Terraform"  = "true"
        } -> null

      - encryption_configuration {
          - encryption_type = "AES256" -> null
            # (1 unchanged attribute hidden)
        }

      - image_scanning_configuration {
          - scan_on_push = true -> null
        }
    }

  # aws_ecr_repository.superset_docs_test will be created
  + resource "aws_ecr_repository" "superset_docs_test" {
      + arn                  = (known after apply)
      + id                   = (known after apply)
      + image_tag_mutability = "MUTABLE"
      + name                 = "cds-superset-docs"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags                 = {
          + "CostCentre" = "cds-superset-docs-staging"
          + "Terraform"  = "true"
        }
      + tags_all             = {
          + "CostCentre" = "cds-superset-docs-staging"
          + "Terraform"  = "true"
        }

      + image_scanning_configuration {
          + scan_on_push = true
        }
    }

  # module.superset_docs.data.aws_iam_policy_document.non_vpc_policies[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "non_vpc_policies" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "logs:CreateLogGroup",
              + "logs:CreateLogStream",
              + "logs:PutLogEvents",
            ]
          + effect    = "Allow"
          + resources = [
              + "*",
            ]
          + sid       = "CloudWatchAccess"
        }
      + statement {
          + actions   = [
              + "ecr:BatchGetImage",
              + "ecr:GetDownloadUrlForlayer",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]
          + sid       = "ECRImageAccess"
        }
    }

  # module.superset_docs.aws_iam_policy.non_vpc_policies[0] will be updated in-place
  ~ resource "aws_iam_policy" "non_vpc_policies" {
        id               = "arn:aws:iam::257394494478:policy/cds-superset-docs_non_vpc"
        name             = "cds-superset-docs_non_vpc"
      ~ policy           = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "logs:PutLogEvents",
                          - "logs:CreateLogStream",
                          - "logs:CreateLogGroup",
                        ]
                      - Effect   = "Allow"
                      - Resource = "*"
                      - Sid      = "CloudWatchAccess"
                    },
                  - {
                      - Action   = [
                          - "ecr:GetDownloadUrlForlayer",
                          - "ecr:BatchGetImage",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:ecr:ca-central-1:257394494478:repository/cds-superset-docs"
                      - Sid      = "ECRImageAccess"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags             = {
            "CostCentre" = "cds-superset-docs-staging"
            "Terraform"  = "true"
        }
        # (7 unchanged attributes hidden)
    }

  # module.superset_docs.aws_lambda_function.this will be updated in-place
  ~ resource "aws_lambda_function" "this" {
      - description                    = "Force restart" -> null
        id                             = "cds-superset-docs"
        tags                           = {
            "CostCentre" = "cds-superset-docs-staging"
            "Terraform"  = "true"
        }
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

Plan: 2 to add, 2 to change, 2 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"
Releasing state lock. This may take a few moments...

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_event_rule.superset_docs"]
WARN - plan.json - main - Cloudwatch log metric pattern is invalid: ["aws_cloudwatch_log_metric_filter.superset_docs_errors"]

20 tests, 18 passed, 2 warnings, 0 failures, 0 exceptions

```

</details>
